wub163/XW_0011_F_0162_V1.0.0/MM32F0160_Device/MM32F0160/Include/reg_tim.h
/*
 *******************************************************************************
    @file     reg_tim.h
    @author   AE TEAM
    @brief    THIS FILE CONTAINS ALL THE FUNCTIONS PROTOTYPES FOR THE ADC
              FIRMWARE LIBRARY.
 *******************************************************************************
    @attention

    <h2><center>&copy; Copyright(c) <2023> <MindMotion></center></h2>

    Redistribution and use in source and binary forms, with or without
    modification, are permitted provided that the
    following conditions are met:
    1. Redistributions of source code must retain the above copyright notice,
       this list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice,
       this list of conditions and the following disclaimer in the documentation
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its
       contributors may be used to endorse or promote products derived from this
       software without specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
    AND ANY EXPRESS OR IMPLIED WARRANTIES,INCLUDING, BUT NOT LIMITED TO,
    THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
    PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR
    CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
    EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
    PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
    OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
    WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
    OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF
    ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *******************************************************************************
 */

/* Define to prevent recursive inclusion -------------------------------------*/

#ifndef __REG_TIM_H
#define __REG_TIM_H

/* Files includes ------------------------------------------------------------*/
#include <core_cm0.h>

#ifdef __cplusplus
extern "C" {
#endif

#if defined(__CC_ARM)
#pragma anon_unions
#elif defined(__ICCARM__)
#pragma language=extended
#elif defined(__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050)
#pragma clang diagnostic ignored "-Wc11-extensions"
#pragma clang diagnostic ignored "-Wreserved-id-macro"
#elif defined(__GNUC__)
/* anonymous unions are enabled by default -----------------------------------*/
#else
#warning Not supported compiler type
#endif

/**
  * @brief TIM Base Address Definition
  */
#define TIM1_BASE                       (APB2PERIPH_BASE + 0x2C00)              /*!< Base Address: 0x40012C00 */
#define TIM2_BASE                       (APB1PERIPH_BASE + 0x0000)              /*!< Base Address: 0x40000000 */
#define TIM3_BASE                       (APB1PERIPH_BASE + 0x0400)              /*!< Base Address: 0x40000400 */

#define TIM14_BASE                      (APB2PERIPH_BASE + 0x4000)              /*!< Base Address: 0x40014000 */
#define TIM16_BASE                      (APB2PERIPH_BASE + 0x4400)              /*!< Base Address: 0x40014400 */
#define TIM17_BASE                      (APB2PERIPH_BASE + 0x4800)              /*!< Base Address: 0x40014800 */

/**
  * @brief Timer Register Structure Definition
  */
typedef struct {
    __IO uint32_t CR1;                                                          /*!< TIM control register 1,                        offset: 0x00 */
    __IO uint32_t CR2;                                                          /*!< TIM control register 2,                        offset: 0x04 */
    __IO uint32_t SMCR;                                                         /*!< TIM slave Mode Control register,               offset: 0x08 */
    __IO uint32_t DIER;                                                         /*!< TIM DMA/interrupt enable register,             offset: 0x0C */
    __IO uint32_t SR;                                                           /*!< TIM status register,                           offset: 0x10 */
    __IO uint32_t EGR;                                                          /*!< TIM event generation register,                 offset: 0x14 */
    __IO uint32_t CCMR1;                                                        /*!< TIM capture/compare mode register 1,           offset: 0x18 */
    __IO uint32_t CCMR2;                                                        /*!< TIM capture/compare mode register 2,           offset: 0x1C */
    __IO uint32_t CCER;                                                         /*!< TIM capture/compare enable register,           offset: 0x20 */
    __IO uint32_t CNT;                                                          /*!< TIM counter register,                          offset: 0x24 */
    __IO uint32_t PSC;                                                          /*!< TIM prescaler register,                        offset: 0x28 */
    __IO uint32_t ARR;                                                          /*!< TIM auto-reload register,                      offset: 0x2C */
    __IO uint32_t RCR;                                                          /*!< TIM repetition counter register,               offset: 0x30 */
    __IO uint32_t CCR1;                                                         /*!< TIM capture/compare register 1,                offset: 0x34 */
    __IO uint32_t CCR2;                                                         /*!< TIM capture/compare register 2,                offset: 0x38 */
    __IO uint32_t CCR3;                                                         /*!< TIM capture/compare register 3,                offset: 0x3C */
    __IO uint32_t CCR4;                                                         /*!< TIM capture/compare register 4,                offset: 0x40 */
    __IO uint32_t BDTR;                                                         /*!< TIM break and dead-time register,              offset: 0x44 */
    __IO uint32_t DCR;                                                          /*!< TIM DMA control register,                      offset: 0x48 */
    __IO uint32_t DMAR;                                                         /*!< TIM DMA address for full transfer register,    offset: 0x4C */
    __IO uint32_t OR;                                                           /*!< Input Option Register for TIM2|TIM3,           offset: 0x50 */
    __IO uint32_t CCMR3;                                                        /*!< TIM capture/compare mode register 3,           offset: 0x54 */
    __IO uint32_t CCR5;                                                         /*!< TIM capture/compare register 5,                offset: 0x58 */
    __IO uint32_t PDER;                                                         /*!< PWM Shift repeat enable register,              offset: 0x5C */
    __IO uint32_t CCR1FALL;                                                     /*!< PWM shift count CCR1 register,                 offset: 0x60 */
    __IO uint32_t CCR2FALL;                                                     /*!< PWM shift count CCR2 register,                 offset: 0x64 */
    __IO uint32_t CCR3FALL;                                                     /*!< PWM shift count CCR3 register,                 offset: 0x68 */
    __IO uint32_t CCR4FALL;                                                     /*!< PWM shift count CCR4 register,                 offset: 0x6c */
    __IO uint32_t CCR5FALL;                                                     /*!< PWM shift count CCR5 register,                 offset: 0x70 */
    __IO uint32_t BKINF;                                                        /*!< Break Input filter register TIM1|TIM16|TIM17,  offset: 0x74 */
} TIM_TypeDef;

/**
  * @brief TIM type pointer Definition
  */
#define TIM1                            ((TIM_TypeDef*) TIM1_BASE)
#define TIM2                            ((TIM_TypeDef*) TIM2_BASE)
#define TIM3                            ((TIM_TypeDef*) TIM3_BASE)

#define TIM14                           ((TIM_TypeDef*) TIM14_BASE)
#define TIM16                           ((TIM_TypeDef*) TIM16_BASE)
#define TIM17                           ((TIM_TypeDef*) TIM17_BASE)

/**
  * @brief TIM_CR1 Register Bit Definition
  */
#define TIM_CR1_CEN_Pos                 (0)
#define TIM_CR1_CEN                     (0x01U << TIM_CR1_CEN_Pos)              /*!< Counter enable */
#define TIM_CR1_UDIS_Pos                (1)
#define TIM_CR1_UDIS                    (0x01U << TIM_CR1_UDIS_Pos)             /*!< Update disable */
#define TIM_CR1_URS_Pos                 (2)
#define TIM_CR1_URS                     (0x01U << TIM_CR1_URS_Pos)              /*!< Update request source */
#define TIM_CR1_OPM_Pos                 (3)
#define TIM_CR1_OPM                     (0x01U << TIM_CR1_OPM_Pos)              /*!< One pulse mode */
#define TIM_CR1_DIR_Pos                 (4)
#define TIM_CR1_DIR                     (0x01U << TIM_CR1_DIR_Pos)              /*!< Direction */
#define TIM_CR1_CMS_Pos                 (5)
#define TIM_CR1_CMS                     (0x03U << TIM_CR1_CMS_Pos)              /*!< CMS[1:0] bits (Center-aligned mode selection) */
#define TIM_CR1_CMS_EDGEALIGNED         (0x00U << TIM_CR1_CMS_Pos)              /*!< Edge-aligned mode */
#define TIM_CR1_CMS_CENTERALIGNED1      (0x01U << TIM_CR1_CMS_Pos)              /*!< Center-aligned mode 1 */
#define TIM_CR1_CMS_CENTERALIGNED2      (0x02U << TIM_CR1_CMS_Pos)              /*!< Center-aligned mode 2 */
#define TIM_CR1_CMS_CENTERALIGNED3      (0x03U << TIM_CR1_CMS_Pos)              /*!< Center-aligned mode 3 */
#define TIM_CR1_APRE_Pos                (7)
#define TIM_CR1_APRE                    (0x01U << TIM_CR1_APRE_Pos)             /*!< Auto-reload preload enable */
#define TIM_CR1_CKD_Pos                 (8)
#define TIM_CR1_CKD                     (0x03U << TIM_CR1_CKD_Pos)              /*!< CKD[1:0] bits (clock division) */
#define TIM_CR1_CKD_DIV1                (0x00U << TIM_CR1_CKD_Pos)              /*!< Divided by 1 */
#define TIM_CR1_CKD_DIV2                (0x01U << TIM_CR1_CKD_Pos)              /*!< Divided by 2 */
#define TIM_CR1_CKD_DIV4                (0x02U << TIM_CR1_CKD_Pos)              /*!< Divided by 4 */

/**
  * @brief TIM_CR2 Register Bit Definition
  */
#define TIM_CR2_CCPC_Pos                (0)
#define TIM_CR2_CCPC                    (0x01U << TIM_CR2_CCPC_Pos)             /*!< Capture/Compare Preloaded Control */
#define TIM_CR2_CCUS_Pos                (2)
#define TIM_CR2_CCUS                    (0x01U << TIM_CR2_CCUS_Pos)             /*!< Capture/Compare Control Update Selection */
#define TIM_CR2_CCDS_Pos                (3)
#define TIM_CR2_CCDS                    (0x01U << TIM_CR2_CCDS_Pos)             /*!< Capture/Compare DMA Selection */
#define TIM_CR2_MMS_Pos                 (4)
#define TIM_CR2_MMS                     (0x07U << TIM_CR2_MMS_Pos)              /*!< MMS[2:0] bits (Master Mode Selection) */
#define TIM_CR2_MMS_RESET               (0x00U << TIM_CR2_MMS_Pos)              /*!< Master Mode Select: Reset */
#define TIM_CR2_MMS_ENABLE              (0x01U << TIM_CR2_MMS_Pos)              /*!< Master Mode Select: Enable */
#define TIM_CR2_MMS_UPDATE              (0x02U << TIM_CR2_MMS_Pos)              /*!< Master Mode Select: Update */
#define TIM_CR2_MMS_OC1                 (0x03U << TIM_CR2_MMS_Pos)              /*!< Master Mode Select: OC1 */
#define TIM_CR2_MMS_OC1REF              (0x04U << TIM_CR2_MMS_Pos)              /*!< Master Mode Select: OC1Ref */
#define TIM_CR2_MMS_OC2REF              (0x05U << TIM_CR2_MMS_Pos)              /*!< Master Mode Select: OC2Ref */
#define TIM_CR2_MMS_OC3REF              (0x06U << TIM_CR2_MMS_Pos)              /*!< Master Mode Select: OC3Ref */
#define TIM_CR2_MMS_OC4REF              (0x07U << TIM_CR2_MMS_Pos)              /*!< Master Mode Select: OC4Ref */
#define TIM_CR2_TI1S_Pos                (7)
#define TIM_CR2_TI1S                    (0x01U << TIM_CR2_TI1S_Pos)             /*!< TI1 Selection */
#define TIM_CR2_OIS1_Pos                (8)
#define TIM_CR2_OIS1                    (0x01U << TIM_CR2_OIS1_Pos)             /*!< Output Idle state 1 (OC1 output) */
#define TIM_CR2_OIS1N_Pos               (9)
#define TIM_CR2_OIS1N                   (0x01U << TIM_CR2_OIS1N_Pos)            /*!< Output Idle state 1 (OC1N output) */
#define TIM_CR2_OIS2_Pos                (10)
#define TIM_CR2_OIS2                    (0x01U << TIM_CR2_OIS2_Pos)             /*!< Output Idle state 2 (OC2 output) */
#define TIM_CR2_OIS2N_Pos               (11)
#define TIM_CR2_OIS2N                   (0x01U << TIM_CR2_OIS2N_Pos)            /*!< Output Idle state 2 (OC2N output) */
#define TIM_CR2_OIS3_Pos                (12)
#define TIM_CR2_OIS3                    (0x01U << TIM_CR2_OIS3_Pos)             /*!< Output Idle state 3 (OC3 output) */
#define TIM_CR2_OIS3N_Pos               (13)
#define TIM_CR2_OIS3N                   (0x01U << TIM_CR2_OIS3N_Pos)            /*!< Output Idle state 3 (OC3N output) */
#define TIM_CR2_OIS4_Pos                (14)
#define TIM_CR2_OIS4                    (0x01U << TIM_CR2_OIS4_Pos)             /*!< Output Idle state 4 (OC4 output) */

/**
  * @brief TIM_SMCR Register Bit Definition
  */
#define TIM_SMCR_SMS_Pos                (0)
#define TIM_SMCR_SMS                    (0x07U << TIM_SMCR_SMS_Pos)             /*!< SMS[2:0] bits (Slave mode selection) */
#define TIM_SMCR_SMS_OFF                (0x00U << TIM_SMCR_SMS_Pos)             /*!< Slave Mode select: OFF */
#define TIM_SMCR_SMS_ENCODER1           (0x01U << TIM_SMCR_SMS_Pos)             /*!< Slave Mode select: Encoder1 */
#define TIM_SMCR_SMS_ENCODER2           (0x02U << TIM_SMCR_SMS_Pos)             /*!< Slave Mode select: Encoder2 */
#define TIM_SMCR_SMS_ENCODER3           (0x03U << TIM_SMCR_SMS_Pos)             /*!< Slave Mode select: Encoder3 */
#define TIM_SMCR_SMS_RESET              (0x04U << TIM_SMCR_SMS_Pos)             /*!< Slave Mode select: Reset */
#define TIM_SMCR_SMS_GATED              (0x05U << TIM_SMCR_SMS_Pos)             /*!< Slave Mode select: Gated */
#define TIM_SMCR_SMS_TRIGGER            (0x06U << TIM_SMCR_SMS_Pos)             /*!< Slave Mode select: Trigger */
#define TIM_SMCR_SMS_EXTERNAL1          (0x07U << TIM_SMCR_SMS_Pos)             /*!< Slave Mode select: External1 */

#define TIM_SMCR_OCCS_Pos               (3)
#define TIM_SMCR_OCCS                   (0x01U << TIM_SMCR_OCCS_Pos)            /*!< Output compare clear selection */

