wub163/XW_0011_F_0162_V1.0.0/MM32F0160_Device/MM32F0160/Include/reg_tim.h
#define TIM_SMCR_TS_Pos                 (4)
#define TIM_SMCR_TS                     (0x07U << TIM_SMCR_TS_Pos)              /*!< TS[2:0] bits (Trigger selection) */
#define TIM_SMCR_TS_ITR0                (0x00U << TIM_SMCR_TS_Pos)              /*!< Internal Trigger 0 (ITR0) */
#define TIM_SMCR_TS_ITR1                (0x01U << TIM_SMCR_TS_Pos)              /*!< Internal Trigger 1 (ITR1) */
#define TIM_SMCR_TS_ITR2                (0x02U << TIM_SMCR_TS_Pos)              /*!< Internal Trigger 2 (ITR2) */
#define TIM_SMCR_TS_ITR3                (0x03U << TIM_SMCR_TS_Pos)              /*!< Internal Trigger 3 (ITR3) */
#define TIM_SMCR_TS_TI1F_ED             (0x04U << TIM_SMCR_TS_Pos)              /*!< TI1 Edge Detector (TI1F_ED) */
#define TIM_SMCR_TS_TI1FP1              (0x05U << TIM_SMCR_TS_Pos)              /*!< Filtered Timer Input 1 (TI1FP1) */
#define TIM_SMCR_TS_TI2FP2              (0x06U << TIM_SMCR_TS_Pos)              /*!< Filtered Timer Input 2 (TI2FP2) */
#define TIM_SMCR_TS_ETR                 (0x07U << TIM_SMCR_TS_Pos)              /*!< External Trigger input (ETR) */
#define TIM_SMCR_MSM_Pos                (7)
#define TIM_SMCR_MSM                    (0x01U << TIM_SMCR_MSM_Pos)             /*!< Master/slave mode */
#define TIM_SMCR_ETF_Pos                (8)
#define TIM_SMCR_ETF                    (0x0FU << TIM_SMCR_ETF_Pos)             /*!< ETF[3:0] bits (External trigger filter) */
#define TIM_SMCR_ETF_0                  (0x01U << TIM_SMCR_ETF_Pos)             /*!< Bit 0 */
#define TIM_SMCR_ETF_1                  (0x02U << TIM_SMCR_ETF_Pos)             /*!< Bit 1 */
#define TIM_SMCR_ETF_2                  (0x04U << TIM_SMCR_ETF_Pos)             /*!< Bit 2 */
#define TIM_SMCR_ETF_3                  (0x08U << TIM_SMCR_ETF_Pos)             /*!< Bit 3 */
#define TIM_SMCR_ETPS_Pos               (12)
#define TIM_SMCR_ETPS                   (0x03U << TIM_SMCR_ETPS_Pos)            /*!< ETPS[1:0] bits (External trigger prescaler) */
#define TIM_SMCR_ETPS_OFF               (0x00U << TIM_SMCR_ETPS_Pos)            /*!< Prescaler OFF */
#define TIM_SMCR_ETPS_DIV2              (0x01U << TIM_SMCR_ETPS_Pos)            /*!< ETRP frequency divided by 2 */
#define TIM_SMCR_ETPS_DIV4              (0x02U << TIM_SMCR_ETPS_Pos)            /*!< ETRP frequency divided by 4 */
#define TIM_SMCR_ETPS_DIV8              (0x03U << TIM_SMCR_ETPS_Pos)            /*!< ETRP frequency divided by 8 */
#define TIM_SMCR_ECE_Pos                (14)
#define TIM_SMCR_ECE                    (0x01U << TIM_SMCR_ECE_Pos)             /*!< External clock enable */
#define TIM_SMCR_ETP_Pos                (15)
#define TIM_SMCR_ETP                    (0x01U << TIM_SMCR_ETP_Pos)             /*!< External trigger polarity */

/**
  * @brief TIM_DIER Register Bit Definition
  */
#define TIM_DIER_UIE_Pos                (0)
#define TIM_DIER_UIE                    (0x01U << TIM_DIER_UIE_Pos)             /*!< Update interrupt enable */
#define TIM_DIER_CC1IE_Pos              (1)
#define TIM_DIER_CC1IE                  (0x01U << TIM_DIER_CC1IE_Pos)           /*!< Capture/Compare 1 interrupt enable */
#define TIM_DIER_CC2IE_Pos              (2)
#define TIM_DIER_CC2IE                  (0x01U << TIM_DIER_CC2IE_Pos)           /*!< Capture/Compare 2 interrupt enable */
#define TIM_DIER_CC3IE_Pos              (3)
#define TIM_DIER_CC3IE                  (0x01U << TIM_DIER_CC3IE_Pos)           /*!< Capture/Compare 3 interrupt enable */
#define TIM_DIER_CC4IE_Pos              (4)
#define TIM_DIER_CC4IE                  (0x01U << TIM_DIER_CC4IE_Pos)           /*!< Capture/Compare 4 interrupt enable */
#define TIM_DIER_COMIE_Pos              (5)
#define TIM_DIER_COMIE                  (0x01U << TIM_DIER_COMIE_Pos)           /*!< COM interrupt enable */
#define TIM_DIER_TIE_Pos                (6)
#define TIM_DIER_TIE                    (0x01U << TIM_DIER_TIE_Pos)             /*!< Trigger interrupt enable */
#define TIM_DIER_BIE_Pos                (7)
#define TIM_DIER_BIE                    (0x01U << TIM_DIER_BIE_Pos)             /*!< Break interrupt enable */
#define TIM_DIER_UDE_Pos                (8)
#define TIM_DIER_UDE                    (0x01U << TIM_DIER_UDE_Pos)             /*!< Update DMA request enable */
#define TIM_DIER_CC1DE_Pos              (9)
#define TIM_DIER_CC1DE                  (0x01U << TIM_DIER_CC1DE_Pos)           /*!< Capture/Compare 1 DMA request enable */
#define TIM_DIER_CC2DE_Pos              (10)
#define TIM_DIER_CC2DE                  (0x01U << TIM_DIER_CC2DE_Pos)           /*!< Capture/Compare 2 DMA request enable */
#define TIM_DIER_CC3DE_Pos              (11)
#define TIM_DIER_CC3DE                  (0x01U << TIM_DIER_CC3DE_Pos)           /*!< Capture/Compare 3 DMA request enable */
#define TIM_DIER_CC4DE_Pos              (12)
#define TIM_DIER_CC4DE                  (0x01U << TIM_DIER_CC4DE_Pos)           /*!< Capture/Compare 4 DMA request enable */
#define TIM_DIER_COMDE_Pos              (13)
#define TIM_DIER_COMDE                  (0x01U << TIM_DIER_COMDE_Pos)           /*!< COM DMA request enable */
#define TIM_DIER_TDE_Pos                (14)
#define TIM_DIER_TDE                    (0x01U << TIM_DIER_TDE_Pos)             /*!< Trigger DMA request enable */
#define TIM_DIER_CC5IE_Pos              (16)
#define TIM_DIER_CC5IE                  (0x01U << TIM_DIER_CC5IE_Pos)           /*!< Capture/Compare 5 interrupt enable */
#define TIM_DIER_CC5DE_Pos              (17)
#define TIM_DIER_CC5DE                  (0x01U << TIM_DIER_CC5DE_Pos)           /*!< Capture/Compare 5 DMA request enable */

/**
  * @brief TIM_SR Register Bit Definition
  */
#define TIM_SR_UIF_Pos                  (0)
#define TIM_SR_UIF                      (0x01U << TIM_SR_UIF_Pos)               /*!< Update interrupt Flag */
#define TIM_SR_CC1IF_Pos                (1)
#define TIM_SR_CC1IF                    (0x01U << TIM_SR_CC1IF_Pos)             /*!< Capture/Compare 1 interrupt Flag */
#define TIM_SR_CC2IF_Pos                (2)
#define TIM_SR_CC2IF                    (0x01U << TIM_SR_CC2IF_Pos)             /*!< Capture/Compare 2 interrupt Flag */
#define TIM_SR_CC3IF_Pos                (3)
#define TIM_SR_CC3IF                    (0x01U << TIM_SR_CC3IF_Pos)             /*!< Capture/Compare 3 interrupt Flag */
#define TIM_SR_CC4IF_Pos                (4)
#define TIM_SR_CC4IF                    (0x01U << TIM_SR_CC4IF_Pos)             /*!< Capture/Compare 4 interrupt Flag */
#define TIM_SR_COMIF_Pos                (5)
#define TIM_SR_COMIF                    (0x01U << TIM_SR_COMIF_Pos)             /*!< COM interrupt Flag */
#define TIM_SR_TIF_Pos                  (6)
#define TIM_SR_TIF                      (0x01U << TIM_SR_TIF_Pos)               /*!< Trigger interrupt Flag */
#define TIM_SR_BIF_Pos                  (7)
#define TIM_SR_BIF                      (0x01U << TIM_SR_BIF_Pos)               /*!< Break interrupt Flag */

