wub163/XW_0011_F_0162_V1.0.0/MM32F0160_Device/MM32F0160/Include/reg_tim.h
#define TIM_SR_CC1OF_Pos                (9)
#define TIM_SR_CC1OF                    (0x01U << TIM_SR_CC1OF_Pos)             /*!< Capture/Compare 1 Overcapture Flag */
#define TIM_SR_CC2OF_Pos                (10)
#define TIM_SR_CC2OF                    (0x01U << TIM_SR_CC2OF_Pos)             /*!< Capture/Compare 2 Overcapture Flag */
#define TIM_SR_CC3OF_Pos                (11)
#define TIM_SR_CC3OF                    (0x01U << TIM_SR_CC3OF_Pos)             /*!< Capture/Compare 3 Overcapture Flag */
#define TIM_SR_CC4OF_Pos                (12)
#define TIM_SR_CC4OF                    (0x01U << TIM_SR_CC4OF_Pos)             /*!< Capture/Compare 4 Overcapture Flag */

#define TIM_SR_CC5IF_Pos                (16)
#define TIM_SR_CC5IF                    (0x01U << TIM_SR_CC5IF_Pos)             /*!< Capture/Compare 5 interrupt Flag */

/**
  * @brief TIM_EGR Register Bit Definition
  */
#define TIM_EGR_UG_Pos                  (0)
#define TIM_EGR_UG                      (0x01U << TIM_EGR_UG_Pos)               /*!< Update Generation */
#define TIM_EGR_CC1G_Pos                (1)
#define TIM_EGR_CC1G                    (0x01U << TIM_EGR_CC1G_Pos)             /*!< Capture/Compare 1 Generation */
#define TIM_EGR_CC2G_Pos                (2)
#define TIM_EGR_CC2G                    (0x01U << TIM_EGR_CC2G_Pos)             /*!< Capture/Compare 2 Generation */
#define TIM_EGR_CC3G_Pos                (3)
#define TIM_EGR_CC3G                    (0x01U << TIM_EGR_CC3G_Pos)             /*!< Capture/Compare 3 Generation */
#define TIM_EGR_CC4G_Pos                (4)
#define TIM_EGR_CC4G                    (0x01U << TIM_EGR_CC4G_Pos)             /*!< Capture/Compare 4 Generation */
#define TIM_EGR_COMG_Pos                (5)
#define TIM_EGR_COMG                    (0x01U << TIM_EGR_COMG_Pos)             /*!< Capture/Compare Control Update Generation */
#define TIM_EGR_TG_Pos                  (6)
#define TIM_EGR_TG                      (0x01U << TIM_EGR_TG_Pos)               /*!< Trigger Generation */
#define TIM_EGR_BG_Pos                  (7)
#define TIM_EGR_BG                      (0x01U << TIM_EGR_BG_Pos)               /*!< Break Generation */

#define TIM_EGR_CC5G_Pos                (16)
#define TIM_EGR_CC5G                    (0x01U << TIM_EGR_CC5G_Pos)             /*!< Capture/Compare 5 Generation */

/**
  * @brief TIM_CCMR1 Register Bit Definition
  */
#define TIM_CCMR1_CC1S_Pos              (0)
#define TIM_CCMR1_CC1S                  (0x03U << TIM_CCMR1_CC1S_Pos)           /*!< CC1S[1:0] bits (Capture/Compare 1 Selection) */
#define TIM_CCMR1_CC1S_OC               (0x00U << TIM_CCMR1_CC1S_Pos)           /*!< Channel is configured as output */
#define TIM_CCMR1_CC1S_TI1              (0x01U << TIM_CCMR1_CC1S_Pos)           /*!< Channel is configured as input, IC1 is mapped on TI1 */
#define TIM_CCMR1_CC1S_TI2              (0x02U << TIM_CCMR1_CC1S_Pos)           /*!< Channel is configured as input, IC1 is mapped on TI2 */
#define TIM_CCMR1_CC1S_TRC              (0x03U << TIM_CCMR1_CC1S_Pos)           /*!< Channel is configured as input, IC1 is mapped on TRC */
#define TIM_CCMR1_OC1FE_Pos             (2)
#define TIM_CCMR1_OC1FE                 (0x01U << TIM_CCMR1_OC1FE_Pos)          /*!< Output Compare 1 Fast enable */
#define TIM_CCMR1_OC1PE_Pos             (3)
#define TIM_CCMR1_OC1PE                 (0x01U << TIM_CCMR1_OC1PE_Pos)          /*!< Output Compare 1 Preload enable */
#define TIM_CCMR1_OC1M_Pos              (4)
#define TIM_CCMR1_OC1M                  (0x07U << TIM_CCMR1_OC1M_Pos)           /*!< OC1M[2:0] bits (Output Compare 1 Mode) */
#define TIM_CCMR1_OC1M_TIMING           (0x00U << TIM_CCMR1_OC1M_Pos)           /*!< Timing */
#define TIM_CCMR1_OC1M_ACTIVE           (0x01U << TIM_CCMR1_OC1M_Pos)           /*!< Active */
#define TIM_CCMR1_OC1M_INACTIVE         (0x02U << TIM_CCMR1_OC1M_Pos)           /*!< Inactive */
#define TIM_CCMR1_OC1M_TOGGLE           (0x03U << TIM_CCMR1_OC1M_Pos)           /*!< Toggle */
#define TIM_CCMR1_OC1M_FORCEINACTIVE    (0x04U << TIM_CCMR1_OC1M_Pos)           /*!< Forceinactive */
#define TIM_CCMR1_OC1M_FORCEACTIVE      (0x05U << TIM_CCMR1_OC1M_Pos)           /*!< Forceactive */
#define TIM_CCMR1_OC1M_PWM1             (0x06U << TIM_CCMR1_OC1M_Pos)           /*!< PWM1 */
#define TIM_CCMR1_OC1M_PWM2             (0x07U << TIM_CCMR1_OC1M_Pos)           /*!< PWM2 */
#define TIM_CCMR1_OC1CE_Pos             (7)
#define TIM_CCMR1_OC1CE                 (0x01U << TIM_CCMR1_OC1CE_Pos)          /*!< Output Compare 1Clear Enable */

#define TIM_CCMR1_CC2S_Pos              (8)
#define TIM_CCMR1_CC2S                  (0x03U << TIM_CCMR1_CC2S_Pos)           /*!< CC2S[1:0] bits (Capture/Compare 2 Selection) */
#define TIM_CCMR1_CC2S_OC               (0x00U << TIM_CCMR1_CC2S_Pos)           /*!< Channel is configured as output */
#define TIM_CCMR1_CC2S_TI2              (0x01U << TIM_CCMR1_CC2S_Pos)           /*!< Channel is configured as input, IC2 is mapped on TI2 */
#define TIM_CCMR1_CC2S_TI1              (0x02U << TIM_CCMR1_CC2S_Pos)           /*!< Channel is configured as input, IC2 is mapped on TI1 */
#define TIM_CCMR1_CC2S_TRC              (0x03U << TIM_CCMR1_CC2S_Pos)           /*!< Channel is configured as input, IC2 is mapped on TRC */
#define TIM_CCMR1_OC2FE_Pos             (10)
#define TIM_CCMR1_OC2FE                 (0x01U << TIM_CCMR1_OC2FE_Pos)          /*!< Output Compare 2 Fast enable */
#define TIM_CCMR1_OC2PE_Pos             (11)
#define TIM_CCMR1_OC2PE                 (0x01U << TIM_CCMR1_OC2PE_Pos)          /*!< Output Compare 2 Preload enable */
#define TIM_CCMR1_OC2M_Pos              (12)
#define TIM_CCMR1_OC2M                  (0x07U << TIM_CCMR1_OC2M_Pos)           /*!< OC2M[2:0] bits (Output Compare 2 Mode) */
#define TIM_CCMR1_OC2M_TIMING           (0x00U << TIM_CCMR1_OC2M_Pos)           /*!< Timing */
#define TIM_CCMR1_OC2M_ACTIVE           (0x01U << TIM_CCMR1_OC2M_Pos)           /*!< Active */
#define TIM_CCMR1_OC2M_INACTIVE         (0x02U << TIM_CCMR1_OC2M_Pos)           /*!< Inactive */
#define TIM_CCMR1_OC2M_TOGGLE           (0x03U << TIM_CCMR1_OC2M_Pos)           /*!< Toggle */
#define TIM_CCMR1_OC2M_FORCEINACTIVE    (0x04U << TIM_CCMR1_OC2M_Pos)           /*!< Forceinactive */
#define TIM_CCMR1_OC2M_FORCEACTIVE      (0x05U << TIM_CCMR1_OC2M_Pos)           /*!< Forceactive */
#define TIM_CCMR1_OC2M_PWM1             (0x06U << TIM_CCMR1_OC2M_Pos)           /*!< PWM1 */
#define TIM_CCMR1_OC2M_PWM2             (0x07U << TIM_CCMR1_OC2M_Pos)           /*!< PWM2 */
#define TIM_CCMR1_OC2CE_Pos             (15)
#define TIM_CCMR1_OC2CE                 (0x01U << TIM_CCMR1_OC2CE_Pos)          /*!< Output Compare 2 Clear Enable */

