wub163/XW_0011_F_0162_V1.0.0/MM32F0160_Device/MM32F0160/Include/reg_tim.h
#define TIM_CCMR1_IC1PSC_Pos            (2)
#define TIM_CCMR1_IC1PSC                (0x03U << TIM_CCMR1_IC1PSC_Pos)         /*!< IC1PSC[1:0] bits (Input Capture 1 Prescaler) */
#define TIM_CCMR1_IC1PSC_DIV1           (0x00U << TIM_CCMR1_IC1PSC_Pos)         /*!< No Prescaler */
#define TIM_CCMR1_IC1PSC_DIV2           (0x01U << TIM_CCMR1_IC1PSC_Pos)         /*!< Capture is done once every 2 events */
#define TIM_CCMR1_IC1PSC_DIV4           (0x02U << TIM_CCMR1_IC1PSC_Pos)         /*!< Capture is done once every 4 events */
#define TIM_CCMR1_IC1PSC_DIV8           (0x03U << TIM_CCMR1_IC1PSC_Pos)         /*!< Capture is done once every 8 events */
#define TIM_CCMR1_IC1F_Pos              (4)
#define TIM_CCMR1_IC1F                  (0x0FU << TIM_CCMR1_IC1F_Pos)           /*!< IC1F[3:0] bits (Input Capture 1 Filter) */
#define TIM_CCMR1_IC1F_0                (0x01U << TIM_CCMR1_IC1F_Pos)           /*!< Bit 0 */
#define TIM_CCMR1_IC1F_1                (0x02U << TIM_CCMR1_IC1F_Pos)           /*!< Bit 1 */
#define TIM_CCMR1_IC1F_2                (0x04U << TIM_CCMR1_IC1F_Pos)           /*!< Bit 2 */
#define TIM_CCMR1_IC1F_3                (0x08U << TIM_CCMR1_IC1F_Pos)           /*!< Bit 3 */

#define TIM_CCMR1_IC2PSC_Pos            (10)
#define TIM_CCMR1_IC2PSC                (0x03U << TIM_CCMR1_IC2PSC_Pos)         /*!< IC2PSC[1:0] bits (Input Capture 2 Prescaler) */
#define TIM_CCMR1_IC2PSC_DIV1           (0x00U << TIM_CCMR1_IC2PSC_Pos)         /*!< No Prescaler */
#define TIM_CCMR1_IC2PSC_DIV2           (0x01U << TIM_CCMR1_IC2PSC_Pos)         /*!< Capture is done once every 2 events */
#define TIM_CCMR1_IC2PSC_DIV4           (0x02U << TIM_CCMR1_IC2PSC_Pos)         /*!< Capture is done once every 4 events */
#define TIM_CCMR1_IC2PSC_DIV8           (0x03U << TIM_CCMR1_IC2PSC_Pos)         /*!< Capture is done once every 8 events */
#define TIM_CCMR1_IC2F_Pos              (12)
#define TIM_CCMR1_IC2F                  (0x0FU << TIM_CCMR1_IC2F_Pos)           /*!< IC2F[3:0] bits (Input Capture 2 Filter) */
#define TIM_CCMR1_IC2F_0                (0x01U << TIM_CCMR1_IC2F_Pos)           /*!< Bit 0 */
#define TIM_CCMR1_IC2F_1                (0x02U << TIM_CCMR1_IC2F_Pos)           /*!< Bit 1 */
#define TIM_CCMR1_IC2F_2                (0x04U << TIM_CCMR1_IC2F_Pos)           /*!< Bit 2 */
#define TIM_CCMR1_IC2F_3                (0x08U << TIM_CCMR1_IC2F_Pos)           /*!< Bit 3 */

/**
  * @brief TIM_CCMR2 Register Bit Definition
  */
#define TIM_CCMR2_CC3S_Pos              (0)
#define TIM_CCMR2_CC3S                  (0x03U << TIM_CCMR2_CC3S_Pos)           /*!< CC3S[1:0] bits (Capture/Compare 3 Selection) */
#define TIM_CCMR2_CC3S_OC               (0x00U << TIM_CCMR2_CC3S_Pos)           /*!< Channel is configured as output */
#define TIM_CCMR2_CC3S_TI3              (0x01U << TIM_CCMR2_CC3S_Pos)           /*!< Channel is configured as input, IC3 is mapped on TI3 */
#define TIM_CCMR2_CC3S_TI4              (0x02U << TIM_CCMR2_CC3S_Pos)           /*!< Channel is configured as input, IC3 is mapped on TI4 */
#define TIM_CCMR2_CC3S_TRC              (0x03U << TIM_CCMR2_CC3S_Pos)           /*!< Channel is configured as input, IC3 is mapped on TRC */
#define TIM_CCMR2_OC3FE_Pos             (2)
#define TIM_CCMR2_OC3FE                 (0x01U << TIM_CCMR2_OC3FE_Pos)          /*!< Output Compare 3 Fast enable */
#define TIM_CCMR2_OC3PE_Pos             (3)
#define TIM_CCMR2_OC3PE                 (0x01U << TIM_CCMR2_OC3PE_Pos)          /*!< Output Compare 3 Preload enable */
#define TIM_CCMR2_OC3M_Pos              (4)
#define TIM_CCMR2_OC3M                  (0x07U << TIM_CCMR2_OC3M_Pos)           /*!< OC3M[2:0] bits (Output Compare 3 Mode) */
#define TIM_CCMR2_OC3M_TIMING           (0x00U << TIM_CCMR2_OC3M_Pos)           /*!< Timing */
#define TIM_CCMR2_OC3M_ACTIVE           (0x01U << TIM_CCMR2_OC3M_Pos)           /*!< Active */
#define TIM_CCMR2_OC3M_INACTIVE         (0x02U << TIM_CCMR2_OC3M_Pos)           /*!< Inactive */
#define TIM_CCMR2_OC3M_TOGGLE           (0x03U << TIM_CCMR2_OC3M_Pos)           /*!< Toggle */
#define TIM_CCMR2_OC3M_FORCEINACTIVE    (0x04U << TIM_CCMR2_OC3M_Pos)           /*!< Forceinactive */
#define TIM_CCMR2_OC3M_FORCEACTIVE      (0x05U << TIM_CCMR2_OC3M_Pos)           /*!< Forceactive */
#define TIM_CCMR2_OC3M_PWM1             (0x06U << TIM_CCMR2_OC3M_Pos)           /*!< PWM1 */
#define TIM_CCMR2_OC3M_PWM2             (0x07U << TIM_CCMR2_OC3M_Pos)           /*!< PWM2 */
#define TIM_CCMR2_OC3CE_Pos             (7)
#define TIM_CCMR2_OC3CE                 (0x01U << TIM_CCMR2_OC3CE_Pos)          /*!< Output Compare 3 Clear Enable */

#define TIM_CCMR2_CC4S_Pos              (8)
#define TIM_CCMR2_CC4S                  (0x03U << TIM_CCMR2_CC4S_Pos)           /*!< CC4S[1:0] bits (Capture/Compare 4 Selection) */
#define TIM_CCMR2_CC4S_OC               (0x00U << TIM_CCMR2_CC4S_Pos)           /*!< Channel is configured as output */
#define TIM_CCMR2_CC4S_TI4              (0x01U << TIM_CCMR2_CC4S_Pos)           /*!< Channel is configured as input, IC4 is mapped on TI4 */
#define TIM_CCMR2_CC4S_TI3              (0x02U << TIM_CCMR2_CC4S_Pos)           /*!< Channel is configured as input, IC4 is mapped on TI3 */
#define TIM_CCMR2_CC4S_TRC              (0x03U << TIM_CCMR2_CC4S_Pos)           /*!< Channel is configured as input, IC4 is mapped on TRC */
#define TIM_CCMR2_OC4FE_Pos             (10)
#define TIM_CCMR2_OC4FE                 (0x01U << TIM_CCMR2_OC4FE_Pos)          /*!< Output Compare 4 Fast enable */
#define TIM_CCMR2_OC4PE_Pos             (11)
#define TIM_CCMR2_OC4PE                 (0x01U << TIM_CCMR2_OC4PE_Pos)          /*!< Output Compare 4 Preload enable */
#define TIM_CCMR2_OC4M_Pos              (12)
#define TIM_CCMR2_OC4M                  (0x07U << TIM_CCMR2_OC4M_Pos)           /*!< OC4M[2:0] bits (Output Compare 4 Mode) */
#define TIM_CCMR2_OC4M_TIMING           (0x00U << TIM_CCMR2_OC4M_Pos)           /*!< Timing */
#define TIM_CCMR2_OC4M_ACTIVE           (0x01U << TIM_CCMR2_OC4M_Pos)           /*!< Active */
#define TIM_CCMR2_OC4M_INACTIVE         (0x02U << TIM_CCMR2_OC4M_Pos)           /*!< Inactive */
#define TIM_CCMR2_OC4M_TOGGLE           (0x03U << TIM_CCMR2_OC4M_Pos)           /*!< Toggle */
#define TIM_CCMR2_OC4M_FORCEINACTIVE    (0x04U << TIM_CCMR2_OC4M_Pos)           /*!< Forceinactive */
#define TIM_CCMR2_OC4M_FORCEACTIVE      (0x05U << TIM_CCMR2_OC4M_Pos)           /*!< Forceactive */
#define TIM_CCMR2_OC4M_PWM1             (0x06U << TIM_CCMR2_OC4M_Pos)           /*!< PWM1 */
#define TIM_CCMR2_OC4M_PWM2             (0x07U << TIM_CCMR2_OC4M_Pos)           /*!< PWM2 */
#define TIM_CCMR2_OC4CE_Pos             (15)
#define TIM_CCMR2_OC4CE                 (0x01U << TIM_CCMR2_OC4CE_Pos)          /*!< Output Compare 4 Clear Enable */


#define TIM_CCMR2_IC3PSC_Pos            (2)
#define TIM_CCMR2_IC3PSC                (0x03U << TIM_CCMR2_IC3PSC_Pos)         /*!< IC3PSC[1:0] bits (Input Capture 3 Prescaler) */
#define TIM_CCMR2_IC3PSC_DIV1           (0x00U << TIM_CCMR2_IC3PSC_Pos)         /*!< No Prescaler */
#define TIM_CCMR2_IC3PSC_DIV2           (0x01U << TIM_CCMR2_IC3PSC_Pos)         /*!< Capture is done once every 2 events */
#define TIM_CCMR2_IC3PSC_DIV4           (0x02U << TIM_CCMR2_IC3PSC_Pos)         /*!< Capture is done once every 4 events */
#define TIM_CCMR2_IC3PSC_DIV8           (0x03U << TIM_CCMR2_IC3PSC_Pos)         /*!< Capture is done once every 8 events */
#define TIM_CCMR2_IC3F_Pos              (4)
#define TIM_CCMR2_IC3F                  (0x0FU << TIM_CCMR2_IC3F_Pos)           /*!< IC3F[3:0] bits (Input Capture 3 Filter) */
#define TIM_CCMR2_IC3F_0                (0x01U << TIM_CCMR2_IC3F_Pos)           /*!< Bit 0 */
#define TIM_CCMR2_IC3F_1                (0x02U << TIM_CCMR2_IC3F_Pos)           /*!< Bit 1 */
#define TIM_CCMR2_IC3F_2                (0x04U << TIM_CCMR2_IC3F_Pos)           /*!< Bit 2 */
#define TIM_CCMR2_IC3F_3                (0x08U << TIM_CCMR2_IC3F_Pos)           /*!< Bit 3 */

#define TIM_CCMR2_IC4PSC_Pos            (10)
#define TIM_CCMR2_IC4PSC                (0x03U << TIM_CCMR2_IC4PSC_Pos)         /*!< IC4PSC[1:0] bits (Input Capture 4 Prescaler) */
#define TIM_CCMR2_IC4PSC_DIV1           (0x00U << TIM_CCMR2_IC4PSC_Pos)         /*!< No Prescaler */
#define TIM_CCMR2_IC4PSC_DIV2           (0x01U << TIM_CCMR2_IC4PSC_Pos)         /*!< Capture is done once every 2 events */
#define TIM_CCMR2_IC4PSC_DIV4           (0x02U << TIM_CCMR2_IC4PSC_Pos)         /*!< Capture is done once every 4 events */
#define TIM_CCMR2_IC4PSC_DIV8           (0x03U << TIM_CCMR2_IC4PSC_Pos)         /*!< Capture is done once every 8 events */
#define TIM_CCMR2_IC4F_Pos              (12)
#define TIM_CCMR2_IC4F                  (0x0FU << TIM_CCMR2_IC4F_Pos)           /*!< IC4F[3:0] bits (Input Capture 4 Filter) */
#define TIM_CCMR2_IC4F_0                (0x01U << TIM_CCMR2_IC4F_Pos)           /*!< Bit 0 */
#define TIM_CCMR2_IC4F_1                (0x02U << TIM_CCMR2_IC4F_Pos)           /*!< Bit 1 */
#define TIM_CCMR2_IC4F_2                (0x04U << TIM_CCMR2_IC4F_Pos)           /*!< Bit 2 */
#define TIM_CCMR2_IC4F_3                (0x08U << TIM_CCMR2_IC4F_Pos)           /*!< Bit 3 */

/**
  * @brief TIM_CCER Register Bit Definition
  */
#define TIM_CCER_CC1E_Pos               (0)
#define TIM_CCER_CC1E                   (0x01U << TIM_CCER_CC1E_Pos)            /*!< Capture/Compare 1 output enable */
#define TIM_CCER_CC1P_Pos               (1)
#define TIM_CCER_CC1P                   (0x01U << TIM_CCER_CC1P_Pos)            /*!< Capture/Compare 1 output Polarity */
#define TIM_CCER_CC1NE_Pos              (2)
#define TIM_CCER_CC1NE                  (0x01U << TIM_CCER_CC1NE_Pos)           /*!< Capture/Compare 1 Complementary output enable */
#define TIM_CCER_CC1NP_Pos              (3)
#define TIM_CCER_CC1NP                  (0x01U << TIM_CCER_CC1NP_Pos)           /*!< Capture/Compare 1 Complementary output Polarity */
#define TIM_CCER_CC2E_Pos               (4)
#define TIM_CCER_CC2E                   (0x01U << TIM_CCER_CC2E_Pos)            /*!< Capture/Compare 2 output enable */
#define TIM_CCER_CC2P_Pos               (5)
#define TIM_CCER_CC2P                   (0x01U << TIM_CCER_CC2P_Pos)            /*!< Capture/Compare 2 output Polarity */
#define TIM_CCER_CC2NE_Pos              (6)
#define TIM_CCER_CC2NE                  (0x01U << TIM_CCER_CC2NE_Pos)           /*!< Capture/Compare 2 Complementary output enable */
#define TIM_CCER_CC2NP_Pos              (7)
#define TIM_CCER_CC2NP                  (0x01U << TIM_CCER_CC2NP_Pos)           /*!< Capture/Compare 2 Complementary output Polarity */
#define TIM_CCER_CC3E_Pos               (8)
#define TIM_CCER_CC3E                   (0x01U << TIM_CCER_CC3E_Pos)            /*!< Capture/Compare 3 output enable */
#define TIM_CCER_CC3P_Pos               (9)
#define TIM_CCER_CC3P                   (0x01U << TIM_CCER_CC3P_Pos)            /*!< Capture/Compare 3 output Polarity */
#define TIM_CCER_CC3NE_Pos              (10)
#define TIM_CCER_CC3NE                  (0x01U << TIM_CCER_CC3NE_Pos)           /*!< Capture/Compare 3 Complementary output enable */
#define TIM_CCER_CC3NP_Pos              (11)
#define TIM_CCER_CC3NP                  (0x01U << TIM_CCER_CC3NP_Pos)           /*!< Capture/Compare 3 Complementary output Polarity */
#define TIM_CCER_CC4E_Pos               (12)
#define TIM_CCER_CC4E                   (0x01U << TIM_CCER_CC4E_Pos)            /*!< Capture/Compare 4 output enable */
#define TIM_CCER_CC4P_Pos               (13)
#define TIM_CCER_CC4P                   (0x01U << TIM_CCER_CC4P_Pos)            /*!< Capture/Compare 4 output Polarity */
#define TIM_CCER_CC4NP_Pos              (15)
#define TIM_CCER_CC4NP                  (0x01U << TIM_CCER_CC4NP_Pos)           /*!< Capture/Compare 4 Complementary output Polarity */

/**
  * @brief TIM_CNT Register Bit Definition
  */
#define TIM_CNT_POS                     (0)
#define TIM_CNT                         (0xFFFFU << TIM_CNT_POS)                /*!< Counter Value */

/**
  * @brief TIM_PSC Register Bit Definition
  */
#define TIM_PSC_POS                     (0)
#define TIM_PSC                         (0xFFFFU << TIM_PSC_POS)                /*!< Prescaler Value */

/**
  * @brief TIM_ARR Register Bit Definition
  */
#define TIM_ARR_POS                     (0)
#define TIM_ARR                         (0xFFFFU << TIM_ARR_POS)                /*!< actual auto-reload Value */

/**
  * @brief TIM_RCR Register Bit Definition
  */
#define TIM_RCR_REP_POS                 (0)
#define TIM_RCR_REP                     (0xFFU << TIM_RCR_REP_POS)              /*!< Repetition Counter Value */
#define TIM_RCR_REP_CNT_Pos             (8)
#define TIM_RCR_REP_CNT                 (0xFFU << TIM_RCR_REP_CNT_Pos)          /*!< Repetition counter value of real-time writing */

/**
  * @brief TIM_CCR1 Register Bit Definition
  */
#define TIM_CCR1_POS                    (0)
#define TIM_CCR1                        (0xFFFFU << TIM_CCR1_POS)               /*!< Capture/Compare 1 Value */

/**
  * @brief TIM_CCR2 Register Bit Definition
  */
#define TIM_CCR2_POS                    (0)
#define TIM_CCR2                        (0xFFFFU << TIM_CCR2_POS)               /*!< Capture/Compare 2 Value */

/**
  * @brief TIM_CCR3 Register Bit Definition
  */
#define TIM_CCR3_POS                    (0)
#define TIM_CCR3                        (0xFFFFU << TIM_CCR3_POS)               /*!< Capture/Compare 3 Value */

/**
  * @brief TIM_CCR4 Register Bit Definition
  */
#define TIM_CCR4_POS                    (0)
#define TIM_CCR4                        (0xFFFFU << TIM_CCR4_POS)               /*!< Capture/Compare 4 Value */

/**
  * @brief TIM_BDTR Register Bit Definition
  */
#define TIM_BDTR_DTG_Pos                (0)
#define TIM_BDTR_DTG                    (0xFFU << TIM_BDTR_DTG_Pos)             /*!< DTG[0:7] bits (Dead-Time Generator set-up) */
#define TIM_BDTR_DTG_0                  (0x01U << TIM_BDTR_DTG_Pos)             /*!< Bit 0 */
#define TIM_BDTR_DTG_1                  (0x02U << TIM_BDTR_DTG_Pos)             /*!< Bit 1 */
#define TIM_BDTR_DTG_2                  (0x04U << TIM_BDTR_DTG_Pos)             /*!< Bit 2 */
#define TIM_BDTR_DTG_3                  (0x08U << TIM_BDTR_DTG_Pos)             /*!< Bit 3 */
#define TIM_BDTR_DTG_4                  (0x10U << TIM_BDTR_DTG_Pos)             /*!< Bit 4 */
#define TIM_BDTR_DTG_5                  (0x20U << TIM_BDTR_DTG_Pos)             /*!< Bit 5 */
#define TIM_BDTR_DTG_6                  (0x40U << TIM_BDTR_DTG_Pos)             /*!< Bit 6 */
#define TIM_BDTR_DTG_7                  (0x80U << TIM_BDTR_DTG_Pos)             /*!< Bit 7 */
#define TIM_BDTR_LOCK_Pos               (8)
#define TIM_BDTR_LOCK                   (0x03U << TIM_BDTR_LOCK_Pos)            /*!< LOCK[1:0] bits (Lock Configuration) */
#define TIM_BDTR_LOCK_OFF               (0x00U << TIM_BDTR_LOCK_Pos)            /*!< Lock Off */
#define TIM_BDTR_LOCK_1                 (0x01U << TIM_BDTR_LOCK_Pos)            /*!< Lock Level 1 */
#define TIM_BDTR_LOCK_2                 (0x02U << TIM_BDTR_LOCK_Pos)            /*!< Lock Level 2 */
#define TIM_BDTR_LOCK_3                 (0x03U << TIM_BDTR_LOCK_Pos)            /*!< Lock Level 3 */
#define TIM_BDTR_OSSI_Pos               (10)
#define TIM_BDTR_OSSI                   (0x01U << TIM_BDTR_OSSI_Pos)            /*!< Off-State Selection for Idle mode */
#define TIM_BDTR_OSSR_Pos               (11)
#define TIM_BDTR_OSSR                   (0x01U << TIM_BDTR_OSSR_Pos)            /*!< Off-State Selection for Run mode */
#define TIM_BDTR_BKE_Pos                (12)
#define TIM_BDTR_BKE                    (0x01U << TIM_BDTR_BKE_Pos)             /*!< Break enable */
#define TIM_BDTR_BKP_Pos                (13)
#define TIM_BDTR_BKP                    (0x01U << TIM_BDTR_BKP_Pos)             /*!< Break Polarity */
#define TIM_BDTR_AOE_Pos                (14)
#define TIM_BDTR_AOE                    (0x01U << TIM_BDTR_AOE_Pos)             /*!< Automatic Output enable */
#define TIM_BDTR_MOE_Pos                (15)
#define TIM_BDTR_MOE                    (0x01U << TIM_BDTR_MOE_Pos)             /*!< Main Output enable */
#define TIM_BDTR_DOE_Pos                (16)
#define TIM_BDTR_DOE                    (0x01U << TIM_BDTR_DOE_Pos)             /*!< Direct Output enable */

/**
  * @brief TIM_DCR Register Bit Definition
  */
#define TIM_DCR_DBA_Pos                 (0)
#define TIM_DCR_DBA                     (0x1FU << TIM_DCR_DBA_Pos)              /*!< DBA[4 :0] bits (DMA Base Address) */
#define TIM_DCR_DBA_0                   (0x01U << TIM_DCR_DBA_Pos)              /*!< Bit 0 */
#define TIM_DCR_DBA_1                   (0x02U << TIM_DCR_DBA_Pos)              /*!< Bit 1 */
#define TIM_DCR_DBA_2                   (0x04U << TIM_DCR_DBA_Pos)              /*!< Bit 2 */
#define TIM_DCR_DBA_3                   (0x08U << TIM_DCR_DBA_Pos)              /*!< Bit 3 */
#define TIM_DCR_DBA_4                   (0x10U << TIM_DCR_DBA_Pos)              /*!< Bit 4 */
#define TIM_DCR_DBL_Pos                 (8)
#define TIM_DCR_DBL                     (0x1FU << TIM_DCR_DBL_Pos)              /*!< DBL[4 :0] bits (DMA Burst Length) */
#define TIM_DCR_DBL_0                   (0x01U << TIM_DCR_DBL_Pos)              /*!< Bit 0 */
#define TIM_DCR_DBL_1                   (0x02U << TIM_DCR_DBL_Pos)              /*!< Bit 1 */
#define TIM_DCR_DBL_2                   (0x04U << TIM_DCR_DBL_Pos)              /*!< Bit 2 */
#define TIM_DCR_DBL_3                   (0x08U << TIM_DCR_DBL_Pos)              /*!< Bit 3 */
#define TIM_DCR_DBL_4                   (0x10U << TIM_DCR_DBL_Pos)              /*!< Bit 4 */

/**
  * @brief TIM_DMAR Register Bit Definition
  */
#define TIM_DMAR_DMAB_Pos               (0)
#define TIM_DMAR_DMAB                   (0xFFFFU << TIM_DMAR_DMAB_Pos)          /*!< DMA register for burst accesses */

/**
  * @brief TIM_OR Register Bit Definition
  */

#define TIM_OR_ETR_RMP_Pos              (0)
#define TIM_OR_ETR_RMP                  (0x03U << TIM_OR_ETR_RMP_Pos)           /*!< ETR multiplex */
#define TIM_OR_ETR_RMP_ETR_GPIO         (0x00U << TIM_OR_ETR_RMP_Pos)           /*!< ETR GPIO input */
#define TIM_OR_ETR_RMP_LSI              (0x01U << TIM_OR_ETR_RMP_Pos)           /*!< LSI clock input */
#define TIM_OR_ETR_RMP_LSE              (0x02U << TIM_OR_ETR_RMP_Pos)           /*!< LSE clock input */
#define TIM_OR_ETR_RMP_HSE_DIV128       (0x03U << TIM_OR_ETR_RMP_Pos)           /*!< HSE_CLK_DIV_128 clock input */
#define TIM_OR_TI4_RMP_Pos              (6)
#define TIM_OR_TI4_RMP                  (0x03U << TIM_OR_TI4_RMP_Pos)           /*!< TI4 multiplex */
#define TIM_OR_TI4_RMP_CH4_GPIO         (0x00U << TIM_OR_TI4_RMP_Pos)           /*!< CH4 GPIO or CPT input */
#define TIM_OR_TI4_RMP_LSI              (0x01U << TIM_OR_TI4_RMP_Pos)           /*!< LSI clock input */
#define TIM_OR_TI4_RMP_LSE              (0x02U << TIM_OR_TI4_RMP_Pos)           /*!< LSE clock input */
#define TIM_OR_TI4_RMP_HSE_DIV128       (0x03U << TIM_OR_TI4_RMP_Pos)           /*!< HSE_CLK_DIV_128 clock input */

/**
  * @brief TIM_CCMR3 Register Bit Definition
  */
#define TIM_CCMR3_OC5PE_Pos             (3)
#define TIM_CCMR3_OC5PE                 (0x01U << TIM_CCMR3_OC5PE_Pos)          /*!< Output Compare 5 Preload enable */

/**
  * @brief TIM_CCR5 Register Bit Definition
  */
#define TIM_CCR5_POS                    (0)
#define TIM_CCR5                        (0xFFFFU << TIM_CCR5_POS)               /*!< Capture/Compare 5 Value */

/**
  * @brief TIM_PDER Register Bit Definition
  */
#define TIM_PDER_CCDREPE_Pos            (0)
#define TIM_PDER_CCDREPE                (0x01U << TIM_PDER_CCDREPE_Pos)         /*!< DMA request flow enable */
#define TIM_PDER_CCR1_SHIFT_EN_Pos      (1)
#define TIM_PDER_CCR1_SHIFT_EN          (0x01U << TIM_PDER_CCR1_SHIFT_EN_Pos)   /*!< CCR1 pwm shift enable */
#define TIM_PDER_CCR2_SHIFT_EN_Pos      (2)
#define TIM_PDER_CCR2_SHIFT_EN          (0x01U << TIM_PDER_CCR2_SHIFT_EN_Pos)   /*!< CCR2 pwm shift enable */
#define TIM_PDER_CCR3_SHIFT_EN_Pos      (3)
#define TIM_PDER_CCR3_SHIFT_EN          (0x01U << TIM_PDER_CCR3_SHIFT_EN_Pos)   /*!< CCR3 pwm shift enable */
#define TIM_PDER_CCR4_SHIFT_EN_Pos      (4)
#define TIM_PDER_CCR4_SHIFT_EN          (0x01U << TIM_PDER_CCR4_SHIFT_EN_Pos)   /*!< CCR4 pwm shift enable */
#define TIM_PDER_CCR5_SHIFT_EN_Pos      (5)
#define TIM_PDER_CCR5_SHIFT_EN          (0x01U << TIM_PDER_CCR5_SHIFT_EN_Pos)   /*!< CCR5 pwm shift enable */

/**
  * @brief TIM_CCR1FALL Register Bit Definition
  */
#define TIM_CCR1FALL_POS                (0)
#define TIM_CCR1FALL                    (0xFFFFU << TIM_CCR1FALL_POS)           /*!< Capture/compare value for ch1 when counting down in PWM center-aligned mode */

/**
  * @brief TIM_CCR2FALL Register Bit Definition
  */
#define TIM_CCR2FALL_POS                (0)
#define TIM_CCR2FALL                    (0xFFFFU << TIM_CCR2FALL_POS)           /*!< Capture/compare value for ch2 when counting down in PWM center-aligned mode */

/**
  * @brief TIM_CCR3FALL Register Bit Definition
  */
#define TIM_CCR3FALL_POS                (0)
#define TIM_CCR3FALL                    (0xFFFFU << TIM_CCR3FALL_POS)           /*!< Capture/compare value for ch3 when counting down in PWM center-aligned mode */

/**
  * @brief TIM_CCR4FALL Register Bit Definition
  */
#define TIM_CCR4FALL_POS                (0)
#define TIM_CCR4FALL                    (0xFFFFU << TIM_CCR4FALL_POS)           /*!< Capture/compare value for ch4 when counting down in PWM center-aligned mode */

/**
  * @brief TIM_CCR5FALL Register Bit Definition
  */
#define TIM_CCR5FALL_POS                (0)
#define TIM_CCR5FALL                    (0xFFFFU << TIM_CCR5FALL_POS)           /*!< Capture/compare value for ch5 when counting down in PWM center-aligned mode */

/**
  * @brief TIM_BKINF Register Bit Definition
  */
#define TIM_BKINF_BKINFE_Pos            (0)
#define TIM_BKINF_BKINFE                (0x01U << TIM_BKINF_BKINFE_Pos)         /*!< Break input filter enable */

