wub163/XW_0011_F_0162_V1.0.0/MM32F0160_Device/MM32F0160/Include/reg_tim.h
#define TIM_BKINF_BKINF_Pos             (1)
#define TIM_BKINF_BKINF                 (0x0FU << TIM_BKINF_BKINF_Pos)          /*!< Break input filter */
#define TIM_BKINF_BKINF_0               (0x01U << TIM_BKINF_BKINF_Pos)          /*!< Bit0 */
#define TIM_BKINF_BKINF_1               (0x02U << TIM_BKINF_BKINF_Pos)          /*!< Bit1 */
#define TIM_BKINF_BKINF_2               (0x04U << TIM_BKINF_BKINF_Pos)          /*!< Bit2 */
#define TIM_BKINF_BKINF_3               (0x08U << TIM_BKINF_BKINF_Pos)          /*!< Bit3 */
#define TIM_BKINF_BKINF_2_Period        (0x00U << TIM_BKINF_BKINF_Pos)          /*!< Filter sampling frequency is 2 cycles */
#define TIM_BKINF_BKINF_4_Period        (0x01U << TIM_BKINF_BKINF_Pos)          /*!< Filter sampling frequency is 4 cycles */
#define TIM_BKINF_BKINF_8_Period        (0x02U << TIM_BKINF_BKINF_Pos)          /*!< Filter sampling frequency is 8 cycles */
#define TIM_BKINF_BKINF_16_Period       (0x03U << TIM_BKINF_BKINF_Pos)          /*!< Filter sampling frequency is 16 cycles */
#define TIM_BKINF_BKINF_32_Period       (0x04U << TIM_BKINF_BKINF_Pos)          /*!< Filter sampling frequency is 32 cycles */
#define TIM_BKINF_BKINF_64_Period       (0x05U << TIM_BKINF_BKINF_Pos)          /*!< Filter sampling frequency is 64 cycles */
#define TIM_BKINF_BKINF_128_Period      (0x06U << TIM_BKINF_BKINF_Pos)          /*!< Filter sampling frequency is 128 cycles */
#define TIM_BKINF_BKINF_256_Period      (0x07U << TIM_BKINF_BKINF_Pos)          /*!< Filter sampling frequency is 256 cycles */
#define TIM_BKINF_BKINF_384_Period      (0x08U << TIM_BKINF_BKINF_Pos)          /*!< Filter sampling frequency is 384 cycles */
#define TIM_BKINF_BKINF_512_Period      (0x09U << TIM_BKINF_BKINF_Pos)          /*!< Filter sampling frequency is 512 cycles */
#define TIM_BKINF_BKINF_640_Period      (0x0AU << TIM_BKINF_BKINF_Pos)          /*!< Filter sampling frequency is 640 cycles */
#define TIM_BKINF_BKINF_768_Period      (0x0BU << TIM_BKINF_BKINF_Pos)          /*!< Filter sampling frequency is 768 cycles */
#define TIM_BKINF_BKINF_896_Period      (0x0CU << TIM_BKINF_BKINF_Pos)          /*!< Filter sampling frequency is 896 cycles */
#define TIM_BKINF_BKINF_1024_Period     (0x0DU << TIM_BKINF_BKINF_Pos)          /*!< Filter sampling frequency is 1024 cycles */
#define TIM_BKINF_BKINF_1152_Period     (0x0EU << TIM_BKINF_BKINF_Pos)          /*!< Filter sampling frequency is 1152 cycles */
#define TIM_BKINF_BKINF_1280_Period     (0x0FU << TIM_BKINF_BKINF_Pos)          /*!< Filter sampling frequency is 1280 cycles */
#define TIM_BKINF_BKIN_SEL_Pos          (5)
#define TIM_BKINF_BKIN_SEL              (0xFFFU << TIM_BKINF_BKIN_SEL_Pos)      /*!< Break input source select */
#define TIM_BKINF_BKIN_SEL_CSS          (0x001U << TIM_BKINF_BKIN_SEL_Pos)      /*!< Bit0 */
#define TIM_BKINF_BKIN_SEL_BKIN1        (0x002U << TIM_BKINF_BKIN_SEL_Pos)      /*!< Bit1 */
#define TIM_BKINF_BKIN_SEL_BKIN2        (0x004U << TIM_BKINF_BKIN_SEL_Pos)      /*!< Bit2 */
#define TIM_BKINF_BKIN_SEL_BKIN3        (0x008U << TIM_BKINF_BKIN_SEL_Pos)      /*!< Bit3 */
#define TIM_BKINF_BKIN_SEL_BKIN4        (0x010U << TIM_BKINF_BKIN_SEL_Pos)      /*!< Bit4 */
#define TIM_BKINF_BKIN_SEL_CPT          (0x040U << TIM_BKINF_BKIN_SEL_Pos)      /*!< Bit6 */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

/*----------------------------------------------------------------------------*/
#endif
/*----------------------------------------------------------------------------*/
